dhimasardinata/esp8266-sensor-node/lib/NodeCore/net/WifiManager.cpp
#include "REDACTED"

#include <ESP8266WiFi.h>
#include <user_interface.h>
#include <algorithm>
#include <cstring>

#include "system/ConfigManager.h"
#include "REDACTED"
#include "system/Logger.h"
#include "config/constants.h"
#include "support/Utils.h"

// Timer intervals
namespace {
  constexpr unsigned long CONNECT_TIMEOUT_MS = 15000;         // 15s per credential attempt
  constexpr unsigned long BACKGROUND_RETRY_MS = 30000;        // 30s background scan interval in portal mode
  constexpr unsigned long ROAM_CHECK_INTERVAL_MS = 10000;     // 10s RSSI check interval
  constexpr unsigned long DISCONNECT_WD_MS = 30 * 60 * 1000;  // 30min disconnect watchdog
  constexpr int32_t ROAM_THRESHOLD_DBM = -80;                 // Roaming threshold (dBm)
  constexpr unsigned long ROAM_COOLDOWN_MS = 120000;          // 2min roaming cooldown
  constexpr unsigned long INITIAL_SCAN_DELAY_MS = 1500;
  constexpr uint32_t SCAN_MIN_HEAP = 7000;
  constexpr uint32_t SCAN_MIN_BLOCK = 3500;
  constexpr uint32_t SCAN_HIDDEN_MIN_HEAP = 10000;
  constexpr uint32_t PORTAL_BG_SCAN_MIN_HEAP = 9000;
  constexpr uint32_t PORTAL_BG_SCAN_MIN_BLOCK = 4500;
  constexpr unsigned long PORTAL_FORCED_SCAN_COOLDOWN_MS = 120000;
  constexpr unsigned long SCAN_TIMEOUT_MS = 15000;
  constexpr unsigned long LITE_SCAN_TIMEOUT_MS = 4000;
  constexpr unsigned long SCAN_SNAPSHOT_IDLE_MS = 60000;
  constexpr uint8_t LITE_SCAN_CHANNELS[] = {1, 6, 11, 3, 9, 13};

  WifiManager* g_wifiManager = REDACTED
}  // namespace

WifiManager:REDACTED
    : m_connectTimeoutTimer(CONNECT_TIMEOUT_MS),
      m_backgroundRetryTimer(BACKGROUND_RETRY_MS),
      m_roamCheckTimer(ROAM_CHECK_INTERVAL_MS),
      m_disconnectWdTimer(DISCONNECT_WD_MS) {
  g_wifiManager = REDACTED
}

void WifiManager:REDACTED
  m_configManager = &configManager;
  if (!m_configManager) {
    LOG_ERROR("WIFI", F("net/WifiManager:REDACTED
    return;
  }

  WiFi.persistent(false);
  WiFi.mode(WIFI_STA);

  // Initialize credential store
  m_credentialStore.init();

  LOG_INFO("REDACTED", F("REDACTED"));

  // Defer initial scan so other modules finish allocating.
  m_initialScanPending = true;
  m_initialScanAt = millis() + INITIAL_SCAN_DELAY_MS;
  setState(State::INITIALIZING);
}

WifiManager:REDACTED
  return m_wifiState;
}

bool WifiManager:REDACTED
  return m_scanInProgress || m_roamingScanInProgress || m_liteScanInProgress || m_forcePortalScanInProgress ||
         m_snapshotScanRequested || m_snapshotScanInProgress;
}

bool WifiManager:REDACTED
  if (m_scanResults) {
    return true;
  }
  std::unique_ptr<WifiScanResult[]> buf(new (std::nothrow) WifiScanResult[MAX_SCAN_RESULTS]());
  if (!buf) {
    LOG_WARN("REDACTED", F("REDACTED"));
    return false;
  }
  m_scanResults.swap(buf);
  m_scanResultCap = MAX_SCAN_RESULTS;
  return true;
}

void WifiManager:REDACTED
  m_scanResults.reset();
  m_scanResultCap = 0;
  m_scanResultCount = 0;
  m_hasScanSnapshot = false;
  m_scanSnapshotLastAccess = 0;
}

uint8_t WifiManager:REDACTED
  if (!out || max == 0 || m_scanResultCount == 0 || !m_scanResults)
    return 0;
  m_scanSnapshotLastAccess = millis();
  uint8_t count = m_scanResultCount < max ? m_scanResultCount : max;
  memcpy(out, m_scanResults.get(), sizeof(WifiScanResult) * count);
  return count;
}

bool WifiManager:REDACTED
  if (m_hasScanSnapshot) {
    m_scanSnapshotLastAccess = millis();
  }
  return m_hasScanSnapshot;
}

void WifiManager:REDACTED
  m_forcePortalScan = true;
  m_forcePortalScanAt = millis() + 200;
}

WifiManager:REDACTED
  if (m_wifiState != REDACTED
    return ScanRequestStatus::UNAVAILABLE;
  }
  if (isScanBusy()) {
    return ScanRequestStatus::BUSY;
  }

  const uint32_t freeHeap = ESP.getFreeHeap();
  const uint32_t freeBlock = ESP.getMaxFreeBlockSize();
  if (freeHeap < SCAN_MIN_HEAP || freeBlock < SCAN_MIN_BLOCK) {
    return ScanRequestStatus::LOW_MEMORY;
  }

  m_snapshotScanRequested = true;
  return ScanRequestStatus::QUEUED;
}

bool WifiManager:REDACTED
  cacheScanResultsFromWifi(scanCount);
  return m_hasScanSnapshot;
}

void WifiManager:REDACTED
  if (isScanBusy()) {
    return;
  }
  releaseScanBuffer();
}

void WifiManager:REDACTED
  if (m_wifiState != REDACTED
    m_wifiState = REDACTED
    for (size_t i = 0; i < m_observerCount; ++i) {
      m_observers[i]->onWifiStateChanged(newState);
    }
  }
}

void WifiManager:REDACTED
  if (m_scanInProgress)
    return;

  uint32_t freeHeap = ESP.getFreeHeap();
  uint32_t freeBlock = ESP.getMaxFreeBlockSize();
  if (freeHeap < SCAN_MIN_HEAP || freeBlock < SCAN_MIN_BLOCK) {
    LOG_WARN("REDACTED",
             F("Scan skipped (low heap: %u, block %u). Opening Portal..."),
             freeHeap,
             freeBlock);
    startPortal();
    return;
  }

  const bool includeHidden = (freeHeap >= SCAN_HIDDEN_MIN_HEAP);
  LOG_INFO("REDACTED", F("REDACTED"));
  m_scanInProgress = true;
  m_scanStartedAt = millis();
  setState(State::SCANNING);

  // Initiate asynchronous network scan.
  WiFi.scanNetworksAsync(
      [](int result) {
        // Handled in handle() loop via scanComplete().
      },
      includeHidden);
}

void WifiManager:REDACTED
  int n = WiFi.scanComplete();

  if (n == WIFI_SCAN_RUNNING) {
    if (m_scanStartedAt != 0 && (millis() - m_scanStartedAt) > SCAN_TIMEOUT_MS) {
      LOG_WARN("REDACTED", F("REDACTED"));
      WiFi.scanDelete();
      m_scanInProgress = false;
      m_scanStartedAt = 0;
      startScan();
    }
    return;  // Still scanning
  }

  m_scanInProgress = false;
  m_scanStartedAt = 0;

  if (n == WIFI_SCAN_FAILED || n < 0) {
    LOG_WARN("REDACTED", F("REDACTED"));
    yield();
    startScan();
    return;
  }

  LOG_INFO("REDACTED", F("REDACTED"), n);

  // Update credential store with scan results
  m_credentialStore.updateFromScan(n);
  m_credentialStore.resetConnectionAttempt();

  // Cache a small list of networks for portal display to avoid re-scans in low heap.
  cacheScanResultsFromWifi(n);

  // Clear scan results to free memory
  WiFi.scanDelete();

