dhimasardinata/esp8266-sensor-node/lib/NodeCore/net/WifiManager.cpp
  // Try to connect to best available credential
  tryNextCredential();
}

void WifiManager:REDACTED
  m_scanResultCount = 0;
  m_hasScanSnapshot = false;
  m_scanSnapshotLastAccess = 0;
  if (scanCount < 0) {
    return;
  }
  const unsigned long now = millis();
  if (scanCount == 0) {
    m_hasScanSnapshot = true;
    m_scanSnapshotLastAccess = now;
    return;
  }
  if (!ensureScanBuffer()) {
    return;
  }
  for (int i = 0; i < scanCount && m_scanResultCount < MAX_SCAN_RESULTS; i++) {
    String ssid = REDACTED
    if (ssid.length() =REDACTED
      continue;
    WifiScanResult& cached = REDACTED
    ssid.toCharArray(cached.ssid, sizeof(cached.ssid));
    cached.rssi = WiFi.RSSI(i);
    cached.isOpen = (WiFi.encryptionType(i) == ENC_TYPE_NONE);
  }
  m_hasScanSnapshot = true;
  m_scanSnapshotLastAccess = now;
}

void WifiManager:REDACTED
  const WifiCredential* cred = REDACTED

  if (cred != nullptr) {
    setState(State::TRYING_NEXT);
    startConnectionAttempt(cred);
  } else {
    // No more credentials available
    LOG_WARN("REDACTED", F("REDACTED"));
    startPortal();
  }
}

void WifiManager:REDACTED
  if (!cred) {
    startPortal();
    return;
  }

  m_activeCredential = *cred;
  m_currentCredential = &m_activeCredential;

  LOG_INFO("REDACTED",
           F("Connecting to: '%s' (RSSI: %d dBm)"),
           m_activeCredential.ssid,
           m_activeCredential.lastRssi);

  WiFi.mode(WIFI_STA);
  WiFi.config(IPAddress(0, 0, 0, 0),
              IPAddress(0, 0, 0, 0),
              IPAddress(0, 0, 0, 0),
              IPAddress(8, 8, 8, 8),
              IPAddress(1, 1, 1, 1));
  WiFi.begin(m_activeCredential.ssid, m_activeCredential.password);

  setState(State::CONNECTING_STA);
  m_connectTimeoutTimer.reset();
}

void WifiManager:REDACTED
  switch (m_wifiState) {
    case State::INITIALIZING:
      if (m_initialScanPending &&
          static_cast<int32_t>(millis() - m_initialScanAt) >= 0) {
        m_initialScanPending = false;
        startScan();
      }
      break;
    case State::SCANNING:
      processScanResults();
      break;
    case State::CONNECTING_STA:
    case State::TRYING_NEXT:
      handleConnecting();
      break;
    case State::CONNECTED_STA:
      handleConnected();
      break;
    case State::PORTAL_MODE:
      handlePortalMode();
      break;
  }
}

void WifiManager:REDACTED
  if (WiFi.status() =REDACTED
    char ssidBuf[WIFI_SSID_MAX_LEN] = REDACTED
    WiFi.SSID().toCharArray(ssidBuf, sizeof(ssidBuf));
    const char* ssid = REDACTED
    if ((ssid[0] =REDACTED
      ssid = REDACTED
    }

    int32_t rssi = WiFi.RSSI();
    IPAddress ip = WiFi.localIP();
    LOG_INFO("REDACTED",
             F("CONNECTED! SSID: REDACTED
             ssid,
             ip[0],
             ip[1],
             ip[2],
             ip[3],
             rssi);
    if (WiFi.getMode() =REDACTED
      WiFi.mode(WIFI_STA);
    setState(State::CONNECTED_STA);
    m_disconnectWdTimer.reset();
    m_hasEverConnected = true;
  } else if (m_connectTimeoutTimer.hasElapsed(false)) {
    const char* ssid = REDACTED
    LOG_WARN("REDACTED", F("REDACTED"), ssid);
    WiFi.disconnect(false);
    delay(100);
    tryNextCredential();
  }
}

void WifiManager:REDACTED
  if (WiFi.status() != REDACTED
    LOG_WARN("REDACTED", F("REDACTED"));
    m_currentCredential = nullptr;
    m_snapshotScanRequested = false;
    m_snapshotScanInProgress = false;
    m_roamingScanInProgress = false;  // Reset roaming state
    startScan();
    return;
  }

  // Free scan cache while connected to keep heap for TLS/HTTP.
  if (!isScanBusy()) {
    if (!m_hasScanSnapshot) {
      releaseScanBuffer();
    } else if (m_scanSnapshotLastAccess != 0 &&
               static_cast<int32_t>(millis() - m_scanSnapshotLastAccess) >=
                   static_cast<int32_t>(SCAN_SNAPSHOT_IDLE_MS)) {
      releaseScanBuffer();
    }
  }
  // Free saved credentials while connected; reload lazily if needed.
  m_credentialStore.releaseSavedCredentials();

  if (m_snapshotScanInProgress) {
    int n = WiFi.scanComplete();
    if (n == WIFI_SCAN_RUNNING) {
      if (m_scanStartedAt != 0 && (millis() - m_scanStartedAt) > SCAN_TIMEOUT_MS) {
        LOG_WARN("REDACTED", F("REDACTED"));
        WiFi.scanDelete();
        m_snapshotScanInProgress = false;
        m_scanStartedAt = 0;
        m_hasScanSnapshot = false;
      }
      m_disconnectWdTimer.reset();
      return;
    }

    m_snapshotScanInProgress = false;
    m_scanStartedAt = 0;
    if (n >= 0) {
      cacheScanResultsFromWifi(n);
      m_credentialStore.updateFromScan(n);
    } else {
      LOG_WARN("REDACTED", F("REDACTED"));
      m_hasScanSnapshot = false;
      m_scanResultCount = 0;
    }
    WiFi.scanDelete();
    m_disconnectWdTimer.reset();
    return;
  }

  if (m_snapshotScanRequested) {
    const uint32_t freeHeap = ESP.getFreeHeap();
    const uint32_t freeBlock = ESP.getMaxFreeBlockSize();
    if (freeHeap < SCAN_MIN_HEAP || freeBlock < SCAN_MIN_BLOCK) {
      LOG_WARN("REDACTED",
               F("Requested scan skipped (low heap: %u, block %u)"),
               freeHeap,
               freeBlock);
      m_snapshotScanRequested = false;
      m_hasScanSnapshot = false;
      m_disconnectWdTimer.reset();
      return;
    }

    LOG_INFO("REDACTED", F("REDACTED"));
    m_snapshotScanRequested = false;
    m_snapshotScanInProgress = true;
    m_hasScanSnapshot = false;
    m_scanResultCount = 0;
    m_scanStartedAt = millis();
    WiFi.scanDelete();
    WiFi.scanNetworksAsync(
        [](int /*result*/) {
          // Result is processed in the next handle() loop.
        },
        false);
    m_disconnectWdTimer.reset();
    return;
  }

  // If a roaming scan is in progress, check for results
  if (m_roamingScanInProgress) {
    int n = WiFi.scanComplete();
    if (n == WIFI_SCAN_RUNNING) {
      // Still scanning, don't block - just return
      m_disconnectWdTimer.reset();
      return;
    }
    // Scan finished (success or fail), process results
    m_roamingScanInProgress = false;
    if (n >= 0) {
      processRoamingScanResults(n);
    } else {
      LOG_WARN("REDACTED", F("REDACTED"));
    }
    WiFi.scanDelete();
    m_disconnectWdTimer.reset();
    return;
  }

  if (!m_roamCheckTimer.hasElapsed()) {
    m_disconnectWdTimer.reset();
    return;
  }

