dhimasardinata/esp8266-sensor-node/lib/NodeCore/net/WifiManager.cpp
  int32_t rssi = WiFi.RSSI();
  if (rssi >= ROAM_THRESHOLD_DBM || millis() - m_lastRoamAttempt < ROAM_COOLDOWN_MS) {
    m_disconnectWdTimer.reset();
    return;
  }

  uint32_t freeHeap = ESP.getFreeHeap();
  uint32_t freeBlock = ESP.getMaxFreeBlockSize();
  if (freeHeap < SCAN_MIN_HEAP || freeBlock < SCAN_MIN_BLOCK) {
    LOG_WARN("REDACTED",
             F("Roam scan skipped (low heap: %u, block %u)"),
             freeHeap,
             freeBlock);
    m_disconnectWdTimer.reset();
    return;
  }

  // Start ASYNC roaming scan (non-blocking!)
  LOG_INFO("REDACTED", F("REDACTED"), rssi);
  m_lastRoamAttempt = millis();
  m_roamingCurrentRssi = rssi;  // Save current RSSI for comparison later
  m_roamingScanInProgress = true;

  WiFi.scanNetworksAsync(
      [](int /*result*/) {
        // Callback is just a trigger - actual processing in next handle() loop
      },
      true);  // true = show hidden networks

  m_disconnectWdTimer.reset();
}

void WifiManager:REDACTED
  if (n < 0)
    return;

  cacheScanResultsFromWifi(n);
  m_credentialStore.updateFromScan(n);
  if (n == 0) {
    return;
  }

  const auto* primary = m_credentialStore.getPrimaryGH();
  const auto* secondary = m_credentialStore.getSecondaryGH();

  // Check if primary GH has significantly better signal
  if (primary && primary->isAvailable() && primary->lastRssi > m_roamingCurrentRssi + 10) {
    LOG_INFO("REDACTED",
             F("Roaming to '%s' (RSSI: %d vs current %d)"),
             primary->ssid,
             primary->lastRssi,
             m_roamingCurrentRssi);
    WiFi.disconnect(false);
    startConnectionAttempt(primary);
    return;
  }

  // Check secondary GH
  if (secondary && secondary->isAvailable() && secondary->lastRssi > m_roamingCurrentRssi + 10) {
    LOG_INFO("REDACTED",
             F("Roaming to '%s' (RSSI: %d vs current %d)"),
             secondary->ssid,
             secondary->lastRssi,
             m_roamingCurrentRssi);
    WiFi.disconnect(false);
    startConnectionAttempt(secondary);
    return;
  }

  // FIX: Also check user-saved networks for roaming
  auto savedCredentials = m_credentialStore.getSavedCredentials();
  for (const auto& cred : savedCredentials) {
    if (!cred.isEmpty() && cred.isAvailable() && cred.lastRssi > m_roamingCurrentRssi + 10) {
      LOG_INFO("REDACTED",
               F("Roaming to saved '%s' (RSSI: %d vs current %d)"),
               cred.ssid,
               cred.lastRssi,
               m_roamingCurrentRssi);
      WiFi.disconnect(false);
      startConnectionAttempt(&cred);
      m_credentialStore.releaseSavedCredentials();
      return;
    }
  }
  m_credentialStore.releaseSavedCredentials();

  LOG_DEBUG("REDACTED", F("REDACTED"));
}

void WifiManager:REDACTED
  if (WiFi.status() =REDACTED
    LOG_INFO("REDACTED", F("REDACTED"));
    setState(State::CONNECTED_STA);
    WiFi.mode(WIFI_STA);
    m_scanInProgress = false;  // Ensure flag is cleared
    m_liteScanInProgress = false;
    m_forcePortalScanInProgress = false;
    m_snapshotScanRequested = false;
    m_snapshotScanInProgress = false;
    m_scanStartedAt = 0;
    return;
  }

  // If STA is disabled, skip background scans to preserve heap for AP portal.
  if ((WiFi.getMode() & WIFI_STA) =REDACTED
    if (m_disconnectWdTimer.hasElapsed()) {
      LOG_ERROR("WIFI", F("Watchdog: REDACTED
      delay(1000);
      ESP.restart();
    }
    return;
  }

  if (m_liteScanInProgress) {
    if (m_scanStartedAt != 0 && (millis() - m_scanStartedAt) > LITE_SCAN_TIMEOUT_MS) {
      LOG_WARN("REDACTED", F("REDACTED"));
      finalizeLiteScan();
    }
    return;
  }

  // 1. Check if a background scan is currently running
  if (m_scanInProgress) {
    if (m_scanStartedAt != 0 && (millis() - m_scanStartedAt) > SCAN_TIMEOUT_MS) {
      LOG_WARN("REDACTED", F("REDACTED"));
      WiFi.scanDelete();
      m_scanInProgress = false;
      m_scanStartedAt = 0;
      if (m_forcePortalScanInProgress) {
        m_forcePortalScanInProgress = false;
        constexpr uint32_t kPortalMinHeapForSta = 8000;
        constexpr uint32_t kPortalMinBlockForSta = 4000;
        const bool allowSta = (ESP.getFreeHeap() >= kPortalMinHeapForSta) &&
                              (ESP.getMaxFreeBlockSize() >= kPortalMinBlockForSta);
        configurePortalAp(allowSta);
      }
      return;
    }
    int n = WiFi.scanComplete();
    if (n >= 0) {
      // Scan Finished
      LOG_INFO("WIFI", F("Background: REDACTED
      cacheScanResultsFromWifi(n);
      m_credentialStore.updateFromScan(n);
      WiFi.scanDelete();
      m_scanInProgress = false;
      m_scanStartedAt = 0;

      // Scan done, try to connect if we found something known
      if (m_credentialStore.getTotalAvailableCount() > 0) {
        m_credentialStore.resetConnectionAttempt();
        const WifiCredential* cred = REDACTED
        if (cred) {
          LOG_INFO("WIFI", F("Background: REDACTED
          WiFi.begin(cred->ssid, cred->password);
        }
      }
    } else if (n == WIFI_SCAN_FAILED) {
      LOG_WARN("WIFI", F("Background: REDACTED
      m_scanInProgress = false;
      m_scanStartedAt = 0;
      WiFi.scanDelete();
    }
    // If n == WIFI_SCAN_RUNNING (-1), just return and check next loop
  }
  // 2. Start new scan if timer elapsed and no scan running
  else if (m_backgroundRetryTimer.hasElapsed()) {
    if (!m_scanInProgress && !m_roamingScanInProgress) {  // Check BOTH flags
      // Avoid overlapping scans triggered by portal UI.
      if (WiFi.scanComplete() =REDACTED
        return;
      }
      if (WiFi.softAPgetStationNum() > 0) {
        LOG_DEBUG("REDACTED", F("REDACTED"));
        return;
      }
      const uint32_t freeHeap = ESP.getFreeHeap();
      const uint32_t freeBlock = ESP.getMaxFreeBlockSize();
      const bool portalLowHeap = (freeHeap < PORTAL_BG_SCAN_MIN_HEAP ||
                                  freeBlock < PORTAL_BG_SCAN_MIN_BLOCK);
      if (portalLowHeap) {
        const unsigned long now = millis();
        if ((now - m_lastForcedPortalScan) >= PORTAL_FORCED_SCAN_COOLDOWN_MS) {
          m_hasScanSnapshot = false;
          m_scanResultCount = 0;
          m_liteScanChannelIndex = 0;
          startLiteScanChannel(LITE_SCAN_CHANNELS[m_liteScanChannelIndex]);
        } else {
          LOG_DEBUG("REDACTED",
                    F("Background scan skipped (portal low heap: %u, block %u)"),
                    freeHeap,
                    freeBlock);
        }
        return;
      }
      if (freeHeap < SCAN_MIN_HEAP || freeBlock < SCAN_MIN_BLOCK) {
        LOG_WARN("REDACTED",
                 F("Background scan skipped (low heap: %u, block %u)"),
                 freeHeap,
                 freeBlock);
        return;
      }
      LOG_DEBUG("WIFI", F("Background: REDACTED
      WiFi.scanDelete();  // free any previous scan buffers
      WiFi.scanNetworksAsync(nullptr, false);  // skip hidden networks to reduce memory
      m_scanInProgress = true;
      m_scanStartedAt = millis();
    }
  }

  if (m_disconnectWdTimer.hasElapsed()) {
    LOG_ERROR("WIFI", F("Watchdog: REDACTED
    delay(1000);
    ESP.restart();
  }

  if (m_forcePortalScan &&
      !m_forcePortalScanInProgress &&
      !m_scanInProgress &&
      !m_roamingScanInProgress &&
      static_cast<int32_t>(millis() - m_forcePortalScanAt) >= 0) {
    m_hasScanSnapshot = false;
    m_scanResultCount = 0;
    m_liteScanChannelIndex = 0;
    startLiteScanChannel(LITE_SCAN_CHANNELS[m_liteScanChannelIndex]);
  }
}

void WifiManager:REDACTED
  // Already in portal mode
  if (m_wifiState =REDACTED
    return;

  if (!m_configManager) {
    LOG_ERROR("WIFI", F("net/WifiManager:REDACTED
    return;
  }

  LOG_INFO("REDACTED", F("REDACTED"));

