dhimasardinata/esp8266-sensor-node/lib/NodeCore/net/WifiManager.cpp
  // Use AP+STA mode: AP for user configuration, STA for background connection attempts.
  WiFi.scanDelete();
  constexpr uint32_t kPortalMinHeapForSta = 8000;
  constexpr uint32_t kPortalMinBlockForSta = 4000;
  const bool allowSta = (ESP.getFreeHeap() >= kPortalMinHeapForSta) &&
                        (ESP.getMaxFreeBlockSize() >= kPortalMinBlockForSta);
  if (!allowSta) {
    LOG_WARN("REDACTED",
             F("Low heap: %u (block %u). Starting AP-only portal."),
             ESP.getFreeHeap(),
             ESP.getMaxFreeBlockSize());
  }
  configurePortalAp(allowSta);
  m_scanInProgress = false;
  m_roamingScanInProgress = false;
  m_liteScanInProgress = false;
  m_forcePortalScanInProgress = false;
  m_snapshotScanRequested = false;
  m_snapshotScanInProgress = false;
  m_scanStartedAt = 0;

  // Reset background timers.
  m_backgroundRetryTimer.reset();
  m_disconnectWdTimer.reset();

  setState(State::PORTAL_MODE);
}

void WifiManager:REDACTED
  LOG_INFO("REDACTED", F("REDACTED"));
  m_currentCredential = nullptr;
  startScan();
}

bool WifiManager:REDACTED
  return m_credentialStore.addCredential(ssid, password, hidden);
}

bool WifiManager:REDACTED
  return m_credentialStore.removeCredential(ssid);
}

void WifiManager:REDACTED
  WiFi.mode(allowSta ? WIFI_AP_STA : REDACTED

  char apName[32];
  m_configManager->getHostname(apName, sizeof(apName));
  const char* portalPassword = REDACTED
  size_t portalPassLen = REDACTED
  const bool passValid = REDACTED
  const char* apPass = REDACTED
  if (!passValid) {
    LOG_WARN("REDACTED", F("REDACTED"));
  }
  if (!allowSta && apPass) {
    LOG_WARN("REDACTED", F("REDACTED"));
    apPass = REDACTED
  }

  WiFi.softAPConfig(IPAddress(192, 168, 4, 1),
                    IPAddress(192, 168, 4, 1),
                    IPAddress(255, 255, 255, 0));
  bool apOk = WiFi.softAP(apName, apPass, 1, false, 1);
  if (!apOk) {
    LOG_ERROR("REDACTED", F("REDACTED"));
    (void)WiFi.softAP(apName, nullptr, 1, false, 1);
  }

  m_configManager->releaseStrings();

  LOG_INFO("WIFI", F("AP Name: REDACTED
  IPAddress ip = WiFi.softAPIP();
  LOG_INFO("WIFI", F("AP IP:   REDACTED
}

void WifiManager:REDACTED
  m_hasScanSnapshot = false;
  m_forcePortalScan = false;
  m_forcePortalScanInProgress = true;
  m_liteScanInProgress = false;
  m_lastForcedPortalScan = millis();
  LOG_WARN("WIFI", F("Portal scan: REDACTED
  WiFi.softAPdisconnect(true);
  WiFi.mode(WIFI_STA);
  delay(50);
  WiFi.scanDelete();
  WiFi.scanNetworksAsync(
      [this](int result) { this->handleForcedPortalScanResult(result); },
      false);
  m_scanInProgress = true;
  m_scanStartedAt = millis();
}

void WifiManager:REDACTED
  m_scanInProgress = false;
  m_forcePortalScanInProgress = false;
  m_scanStartedAt = 0;

  if (scanCount >= 0) {
    m_credentialStore.updateFromScan(scanCount);
    cacheScanResultsFromWifi(scanCount);
  }
  WiFi.scanDelete();

  constexpr uint32_t kPortalMinHeapForSta = 8000;
  constexpr uint32_t kPortalMinBlockForSta = 4000;
  const bool allowSta = (ESP.getFreeHeap() >= kPortalMinHeapForSta) &&
                        (ESP.getMaxFreeBlockSize() >= kPortalMinBlockForSta);
  configurePortalAp(allowSta);
}

void WifiManager:REDACTED
  if (m_scanInProgress)
    return;
  if (m_forcePortalScanInProgress && !m_liteScanInProgress)
    return;
  if (!ensureScanBuffer()) {
    LOG_WARN("REDACTED", F("REDACTED"));
    return;
  }

  m_forcePortalScan = false;
  m_forcePortalScanInProgress = true;
  m_liteScanInProgress = true;
  m_lastForcedPortalScan = millis();
  m_scanStartedAt = millis();

  LOG_WARN("WIFI", F("Lite scan ch%u: REDACTED
  WiFi.softAPdisconnect(true);
  WiFi.mode(WIFI_STA);
  delay(50);

  scan_config config{};
  config.ssid = REDACTED
  config.bssid = REDACTED
  config.channel = channel;
  config.show_hidden = 0;
  if (!wifi_station_scan(&config, WifiManager:REDACTED
    LOG_WARN("REDACTED", F("REDACTED"));
    finalizeLiteScan();
    return;
  }
  m_scanInProgress = true;
}

void WifiManager:REDACTED
  m_scanInProgress = false;
  if (!m_scanResults && !ensureScanBuffer()) {
    LOG_WARN("REDACTED", F("REDACTED"));
    finalizeLiteScan();
    return;
  }

  if (status == OK && arg) {
    bss_info* bss = static_cast<bss_info*>(arg);
    while (bss) {
      if (bss->ssid_len > 0 && m_scanResultCount < MAX_SCAN_RESULTS) {
        const size_t ssidLen = REDACTED
        bool exists = false;
        for (uint8_t i = 0; i < m_scanResultCount; ++i) {
          if (strncmp(m_scanResults[i].ssid, reinterpret_cast<const char*>(bss->ssid), ssidLen) =REDACTED
              m_scanResults[i].ssid[ssidLen] =REDACTED
            exists = true;
            if (bss->rssi > m_scanResults[i].rssi) {
              m_scanResults[i].rssi = bss->rssi;
              m_scanResults[i].isOpen = (bss->authmode == AUTH_OPEN);
            }
            break;
          }
        }
        if (!exists && m_scanResultCount < MAX_SCAN_RESULTS) {
          WifiScanResult& dst = REDACTED
          memcpy(dst.ssid, bss->ssid, ssidLen);
          dst.ssid[ssidLen] = REDACTED
          dst.rssi = bss->rssi;
          dst.isOpen = (bss->authmode == AUTH_OPEN);
        }
      }
      bss = STAILQ_NEXT(bss, next);
    }
  }

  m_liteScanChannelIndex++;
  if (m_liteScanChannelIndex < (sizeof(LITE_SCAN_CHANNELS) / sizeof(LITE_SCAN_CHANNELS[0])) &&
      m_scanResultCount < MAX_SCAN_RESULTS) {
    startLiteScanChannel(LITE_SCAN_CHANNELS[m_liteScanChannelIndex]);
    return;
  }

  m_hasScanSnapshot = (status == OK) || (m_scanResultCount > 0);
  finalizeLiteScan();
}

void WifiManager:REDACTED
  m_liteScanInProgress = false;
  m_forcePortalScanInProgress = false;
  m_scanStartedAt = 0;
  m_scanInProgress = false;
  m_liteScanChannelIndex = 0;

  if (m_scanResultCount > 0 && m_scanResults) {
    std::array<WifiCredentialStore::ScanEntry, MAX_SCAN_RESULTS> entries{};
    for (uint8_t i = 0; i < m_scanResultCount; ++i) {
      entries[i].ssid = REDACTED
      entries[i].len = static_cast<uint8_t>(strnlen(m_scanResults[i].ssid, WIFI_SSID_MAX_LEN - 1));
      entries[i].rssi = m_scanResults[i].rssi;
    }
    m_credentialStore.updateFromScanList(entries.data(), m_scanResultCount);
  }

  constexpr uint32_t kPortalMinHeapForSta = 8000;
  constexpr uint32_t kPortalMinBlockForSta = 4000;
  const bool allowSta = (ESP.getFreeHeap() >= kPortalMinHeapForSta) &&
                        (ESP.getMaxFreeBlockSize() >= kPortalMinBlockForSta);
  configurePortalAp(allowSta);
}

void WifiManager:REDACTED
  if (g_wifiManager) {
    g_wifiManager->handleLiteScanDone(arg, static_cast<int>(status));
  }
}
